ERP DEV.WMS/src/Reports/вмс_ОтчетПоНастройкамМодуля/вмс_ОтчетПоНастройкамМодуля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>вмс_ОтчетПоНастройкамМодуля</name>
</mdclass:Report>

ERP DEV.WMS/src/InformationRegisters/вмс_Лицензии/вмс_Лицензии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_Лицензии</name>
  <resources>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НачалоСеанса</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ИдентификаторКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Лицензия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПубличныйКлюч</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/InformationRegisters/вмс_ЛицензииПодсистем/вмс_ЛицензииПодсистем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_ЛицензииПодсистем</name>
  <resources>
    <name>Отображение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Лицензия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подсистема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/InformationRegisters/вмс_СоединениеОбъектов/вмс_СоединениеОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_СоединениеОбъектов</name>
  <resources>
    <name>ОсновнойРесурс</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектИсточник</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектПриемник</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Схема</name>
    <type>
      <types>CatalogRef.вмс_СхемыСоединенияОбъектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительноеИзмерение1</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительноеИзмерение2</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительноеИзмерение3</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/Enums/вмс_ТипыЯчеек/вмс_ТипыЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>вмс_ТипыЯчеек</name>
  <enumValues>
    <name>ЗонаПриемки</name>
  </enumValues>
  <enumValues>
    <name>ЗонаОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>Хранение</name>
  </enumValues>
  <enumValues>
    <name>ЗонаОтбора</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>ЗонаКонтроля</name>
  </enumValues>
  <enumValues>
    <name>Подпитка</name>
  </enumValues>
  <enumValues>
    <name>Оператор</name>
  </enumValues>
  <enumValues>
    <name>Транзит</name>
  </enumValues>
</mdclass:Enum>

ERP DEV.WMS/src/Catalogs/вмс_Операции/вмс_Операции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_Операции</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ДанныеСКД</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеКладовщикуРаспоряжение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрашиватьУслугиХранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассОперацииХранилище</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяФорма</name>
    <type>
      <types>CatalogRef.вмс_ИнтерфейсыТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаВФормеСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоРаспоряжению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поток</name>
    <type>
      <types>EnumRef.вмс_СкладскиеПотоки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредопределенныеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазбиватьПоПомещениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДДокументы</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДЗаданияКладовщику</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоИнвентаризация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДанныеСКД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКлассОперацииХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСКДДокументы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСКДЗаданияКладовщику</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Распоряжения</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаРаспоряжение</name>
      <type>
        <types>CatalogRef.вмс_РаспоряженияОпераций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыОперации</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.вмс_ЭтапыОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.вмс_СтатусыДокументов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваОперации</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.вмс_СвойстваОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтветственноеХранение</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.вмс_УслугиОтветственногоХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПочтовыеРассылки</name>
    <attributes>
      <name>Рассылка</name>
      <type>
        <types>CatalogRef.вмс_ПочтовыеРассылки</types>
      </type>
    </attributes>
    <attributes>
      <name>Активная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Алгоритмы</name>
    <attributes>
      <name>Алгоритм</name>
      <type>
        <types>CatalogRef.вмс_Алгоритмы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриСохранении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриЗавершении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоКонвертации</name>
      <type>
        <types>CatalogRef.вмс_ПравилаКонвертацииРеквизитов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбработкиПередЗавершением</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Обработка</name>
      <type>
        <types>CatalogRef.вмс_ИнтерфейсыТСД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОперацииПлана</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыОперации</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НаФронтенде</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаБэкенде</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФормыОперации</name>
    <attributes>
      <name>МакетФормы</name>
      <type>
        <types>CatalogRef.вмс_ИнтерфейсыТСД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МетодыОперации</name>
    <attributes>
      <name>ИмяМетода</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Данные</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НормыKPI</name>
    <attributes>
      <name>КоличествоМинут</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЕдиниц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>EnumRef.вмс_ЕдиницыИзмеренияKPI</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/Reports/вмс_ОтчетПоНастройкамМодуля/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	// Заголовок общих данных
	Макет = ПолучитьМакет("Макет");
	ОбластьОбщаяЗаголовок = Макет.ПолучитьОбласть("ОбластьОбщаяЗаголовок");
	ДокументРезультат.Вывести(ОбластьОбщаяЗаголовок);
	
	// Заполнение общих данных
	
	ОбщиеДанные = Новый Соответствие;
	ЛицензииПодсистем = ЛицензииПодсистем();
	Для каждого Лицензия Из ЛицензииПодсистем Цикл
		ОбщиеДанные.Вставить(Лицензия.Отображение, Лицензия.Лицензия);
	КонецЦикла;
	ОбщиеДанные.Вставить("Рег. номер", Справочники.вмс_НастройкиПрограммы.ПолучитьЗначениеНастройкиПрограммы("РегистрационныйНомер"));
	ОбщиеДанные.Вставить("Количество лицензий", КоличествоЛицензийТСД());
	
	Для каждого Настройка Из ОбщиеДанные Цикл
		ОбластьОбщаяСтрока = Макет.ПолучитьОбласть("ОбластьОбщаяСтрока");
		ОбластьОбщаяСтрока.Параметры.Название = Настройка.Ключ;
		ОбластьОбщаяСтрока.Параметры.Значение = Настройка.Значение;
		ДокументРезультат.Вывести(ОбластьОбщаяСтрока);
	КонецЦикла;
	
	// Заголовок настройки модуля
	Макет = ПолучитьМакет("Макет");
	ОбластьНастройкиМодуляЗаголовок = Макет.ПолучитьОбласть("ОбластьНастройкиМодуляЗаголовок");
	ДокументРезультат.Вывести(ОбластьНастройкиМодуляЗаголовок);
	
	// Заполнение настройки модуля	
	Настройка = Справочники.вмс_НастройкиПрограммы.ПолучитьНастройкуПрограммы("ИспользоватьКодыМаркировкиТоваров");
	ОбластьНастройкиМодуляСтрока = Макет.ПолучитьОбласть("ОбластьНастройкиМодуляСтрока");
	ОбластьНастройкиМодуляСтрока.Параметры.Название = Настройка.Наименование;
	ОбластьНастройкиМодуляСтрока.Параметры.Значение = Настройка.Значение;
	ДокументРезультат.Вывести(ОбластьНастройкиМодуляСтрока);
	
	Настройка = Справочники.вмс_НастройкиПрограммы.ПолучитьНастройкуПрограммы("ИспользоватьТару");
	ОбластьНастройкиМодуляСтрока = Макет.ПолучитьОбласть("ОбластьНастройкиМодуляСтрока");
	ОбластьНастройкиМодуляСтрока.Параметры.Название = Настройка.Наименование;
	ОбластьНастройкиМодуляСтрока.Параметры.Значение = Настройка.Значение;
	ДокументРезультат.Вывести(ОбластьНастройкиМодуляСтрока);
	
	Настройка = Справочники.вмс_НастройкиПрограммы.ПолучитьНастройкуПрограммы("ИспользоватьПомещения");
	ОбластьНастройкиМодуляСтрока = Макет.ПолучитьОбласть("ОбластьНастройкиМодуляСтрока");
	ОбластьНастройкиМодуляСтрока.Параметры.Название = Настройка.Наименование;
	ОбластьНастройкиМодуляСтрока.Параметры.Значение = Настройка.Значение;
	ДокументРезультат.Вывести(ОбластьНастройкиМодуляСтрока);
	
	Настройка = Справочники.вмс_НастройкиПрограммы.ПолучитьНастройкуПрограммы("Упаковки_ВестиУчетОстатковПоУпаковкам");
	ОбластьНастройкиМодуляСтрока = Макет.ПолучитьОбласть("ОбластьНастройкиМодуляСтрока");
	ОбластьНастройкиМодуляСтрока.Параметры.Название = Настройка.Наименование;
	ОбластьНастройкиМодуляСтрока.Параметры.Значение = Настройка.Значение;
	ДокументРезультат.Вывести(ОбластьНастройкиМодуляСтрока);
	
	Настройка = Справочники.вмс_НастройкиПрограммы.ПолучитьНастройкуПрограммы("ИспользоватьОтветственноеХранение");
	ОбластьНастройкиМодуляСтрока = Макет.ПолучитьОбласть("ОбластьНастройкиМодуляСтрока");
	ОбластьНастройкиМодуляСтрока.Параметры.Название = Настройка.Наименование;
	ОбластьНастройкиМодуляСтрока.Параметры.Значение = Настройка.Значение;
	ДокументРезультат.Вывести(ОбластьНастройкиМодуляСтрока);
	
	ОбластьНастройкиМодуляСтрока = Макет.ПолучитьОбласть("ОбластьНастройкиМодуляСтрока");
	ОбластьНастройкиМодуляСтрока.Параметры.Название = "Количество услуг ОХ";
	ОбластьНастройкиМодуляСтрока.Параметры.Значение = КоличествоУслугОХ();
	ДокументРезультат.Вывести(ОбластьНастройкиМодуляСтрока);
	
	ОбластьНастройкиМодуляСтрока = Макет.ПолучитьОбласть("ОбластьНастройкиМодуляСтрока");
	ОбластьНастройкиМодуляСтрока.Параметры.Название = "Использовать характеристики";
	ОбластьНастройкиМодуляСтрока.Параметры.Значение = вмс_АдаптацияКонфигураций.ИспользуютсяХарактеристики();
	ДокументРезультат.Вывести(ОбластьНастройкиМодуляСтрока);
	
	ОбластьНастройкиМодуляСтрока = Макет.ПолучитьОбласть("ОбластьНастройкиМодуляСтрока");
	ОбластьНастройкиМодуляСтрока.Параметры.Название = "Использовать серии";
	ОбластьНастройкиМодуляСтрока.Параметры.Значение = вмс_ОперацииПоЯчейкамВызовСервера.ИспользуемыеТоварныеПоля().Найти("Серия") <> Неопределено;
	ДокументРезультат.Вывести(ОбластьНастройкиМодуляСтрока);
	
	ОбластьНастройкиМодуляСтрока = Макет.ПолучитьОбласть("ОбластьНастройкиМодуляСтрока");
	ОбластьНастройкиМодуляСтрока.Параметры.Название = "Видов серийных товаров";
	ОбластьНастройкиМодуляСтрока.Параметры.Значение = КоличествоВидовСерийногоТовара();
	ДокументРезультат.Вывести(ОбластьНастройкиМодуляСтрока);
	
	ОбластьНастройкиМодуляСтрока = Макет.ПолучитьОбласть("ОбластьНастройкиМодуляСтрока");
	ОбластьНастройкиМодуляСтрока.Параметры.Название = "Использовать ВГХ";
	НастройкиРазмещения = вмс_РазмещениеСервер.НастройкиРазмещения();
	ВГХ_ИспользоватьВесогабариты = НастройкиРазмещения.ИспользоватьВГХ;
	ОбластьНастройкиМодуляСтрока.Параметры.Значение = ВГХ_ИспользоватьВесогабариты;
	ДокументРезультат.Вывести(ОбластьНастройкиМодуляСтрока);
	
	// Заголовок топология
	Макет = ПолучитьМакет("Макет");
	ОбластьНастройкиМодуляЗаголовок = Макет.ПолучитьОбласть("ОбластьТопологияСкладаЗаголовок");
	ДокументРезультат.Вывести(ОбластьНастройкиМодуляЗаголовок);
	
	// Заполнение топология
	ТаблицаЗаполненияТопологии = ТаблицаЗаполненияТопологии();
	Для каждого Строка Из ТаблицаЗаполненияТопологии Цикл
		ОбластьТопологияСкладаСтрока = Макет.ПолучитьОбласть("ОбластьТопологияСкладаСтрока");
		ОбластьТопологияСкладаСтрока.Параметры.Заполнить(Строка);
		ДокументРезультат.Вывести(ОбластьТопологияСкладаСтрока);	
	КонецЦикла;
	
	// Заголовок операции
	Макет = ПолучитьМакет("Макет");
	ОбластьОперацииЗаголовок = Макет.ПолучитьОбласть("ОбластьОперацииЗаголовок");
	ДокументРезультат.Вывести(ОбластьОперацииЗаголовок);
	
	// Заполнение операции
	ТаблицаЗаполненияОпераций = ТаблицаЗаполненияОпераций();
	Для каждого Строка Из ТаблицаЗаполненияОпераций Цикл
		ОбластьОперацииСтрока = Макет.ПолучитьОбласть("ОбластьОперацииСтрока");
		ОбластьОперацииСтрока.Параметры.Заполнить(Строка);
		
		ТекстАлгоритмы = "";
		
		Для каждого СтрокаАлгоритмы Из Строка.Операция.Алгоритмы Цикл
			
			Если ЗначениеЗаполнено(СтрокаАлгоритмы.Алгоритм) И (СтрокаАлгоритмы.ПриСохранении ИЛИ СтрокаАлгоритмы.ПриЗавершении) Тогда	
				ТекстАлгоритмы = ТекстАлгоритмы + СтрШаблон("А: %1 (%2)", СтрокаАлгоритмы.Алгоритм, ?(СтрокаАлгоритмы.ПриЗавершении, "завершение", "сохранение"));
				ТекстАлгоритмы = ТекстАлгоритмы + Символы.ПС;
			КонецЕсли;
			
			
			Если ЗначениеЗаполнено(СтрокаАлгоритмы.ПравилоКонвертации) И (СтрокаАлгоритмы.ПриСохранении ИЛИ СтрокаАлгоритмы.ПриЗавершении) Тогда	
				ТекстАлгоритмы = ТекстАлгоритмы + СтрШаблон("ПК: %1 (%2)", СтрокаАлгоритмы.ПравилоКонвертации, ?(СтрокаАлгоритмы.ПриЗавершении, "завершение", "сохранение"));
				ТекстАлгоритмы = ТекстАлгоритмы + Символы.ПС;
			КонецЕсли;
			
		КонецЦикла;
		
		ОбластьОперацииСтрока.Параметры.Алгоритмы = ТекстАлгоритмы;
		
		ДокументРезультат.Вывести(ОбластьОперацииСтрока);
	КонецЦикла;
	
	
	
КонецПроцедуры

Функция Печать() 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Заголовок общих данных
	Макет = ПолучитьМакет("Макет");
	ОбластьОбщаяЗаголовок = Макет.ПолучитьОбласть("ОбластьОбщаяЗаголовок");
	ТабличныйДокумент.Вывести(ОбластьОбщаяЗаголовок);
	
	// Заполнение общих данных
	
	ОбщиеДанные = Новый Соответствие;
	ОбщиеДанные.Вставить("Рег. номер", Справочники.вмс_НастройкиПрограммы.ПолучитьЗначениеНастройкиПрограммы("РегистрационныйНомер"));
	ОбщиеДанные.Вставить("Количество лицензий", КоличествоЛицензийТСД());
	ЛицензииПодсистем = ЛицензииПодсистем();
	
	Для каждого Лицензия Из ЛицензииПодсистем Цикл
		ОбщиеДанные.Вставить(Лицензия.Отображение, Лицензия.Лицензия);
	КонецЦикла;	
	
	Для каждого Настройка Из ОбщиеДанные Цикл
		ОбластьОбщаяСтрока = Макет.ПолучитьОбласть("ОбластьОбщаяСтрока");
		ОбластьОбщаяСтрока.Параметры.Название = Настройка.Ключ;
		ОбластьОбщаяСтрока.Параметры.Значение = Настройка.Значение;
		ТабличныйДокумент.Вывести(ОбластьОбщаяЗаголовок);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
	
	//ОблПодвал = Макет.ПолучитьОбласть("Подвал");
	//ОблТовар = Макет.ПолучитьОбласть("СтрокаТовар");
	//ОблИсполнитель = Макет.ПолучитьОбласть("СтрокаИсполнитель");
	//
	//ТоварныеПоляМассив = вмс_ОперацииПоЯчейкамКлиентСервер.ИспользуемыеТоварныеПоля();
	//вмс_РаботаСКоллекциями.ВычестьМассив(ТоварныеПоляМассив, "Товар");
	//вмс_РаботаСКоллекциями.ВычестьМассив(ТоварныеПоляМассив, "Характеристика");
	//ТоварныеПоля = вмс_РаботаСКоллекциями.МассивВСтроку(ТоварныеПоляМассив);
	//
	//ТоварныеПоляЗаголовокМассив = вмс_РаботаСКоллекциями.СтрокуВМассив(вмс_РаботаСКоллекциями.МассивВСтроку(ТоварныеПоляМассив));
	//ИндексПоискаПоля = ТоварныеПоляЗаголовокМассив.Найти("Партия");
	//Если ИндексПоискаПоля <> Неопределено Тогда
	//	ТоварныеПоляЗаголовокМассив[ИндексПоискаПоля] = "Партия";				
	//КонецЕсли;
	//ТоварныеПоляЗаголовок = вмс_РаботаСКоллекциями.МассивВСтроку(ТоварныеПоляЗаголовокМассив);
	//
	//ОблШапка.Параметры.Распоряжение = Строка(Объект.Ссылка);
	//ОблШапка.Параметры.ТоварныеПоляЗаголовок = ТоварныеПоляЗаголовок;
	//ТабличныйДокумент.Вывести(ОблШапка);
	//
	//Если Объект.Товары.Количество() > 0 Тогда
	//	Если ТоварныеПоля = "" Тогда
	//		ТаблицаТоваров = Объект.Товары.Выгрузить(,"Ячейка, Товар, Характеристика, КоличествоФакт, КоличествоПлан" + ТоварныеПоля);
	//		ТаблицаТоваров.Свернуть("Ячейка, Товар, Характеристика", "КоличествоФакт, КоличествоПлан" + ТоварныеПоля);
	//	Иначе
	//		ТаблицаТоваров = Объект.Товары.Выгрузить(,"Ячейка, Товар, Характеристика, КоличествоФакт, КоличествоПлан, " + ТоварныеПоля);
	//		ТаблицаТоваров.Свернуть("Ячейка, Товар, Характеристика, " + ТоварныеПоля, "КоличествоФакт, КоличествоПлан");
	//	КонецЕсли;
	//	Для Каждого Строка Из ТаблицаТоваров Цикл 
	//		
	//		Если Не ЗначениеЗаполнено(Строка.Товар) Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		ОблТовар.Параметры.Ячейка = Строка(Строка.Ячейка);
	//		ОблТовар.Параметры.Артикул = Строка(Строка.Товар.Артикул);
	//		ОблТовар.Параметры.Товар = Строка(Строка.Товар) + ?(ЗначениеЗаполнено(Строка.Характеристика), ", " + Строка(Строка.Характеристика), "");
	//		ОблТовар.Параметры.КоличествоФакт = Формат(Строка.КоличествоФакт, "ЧДЦ=3");
	//		ОблТовар.Параметры.КоличествоУчет = Формат(Строка.КоличествоПлан, "ЧДЦ=3");
	//		
	//		Для Каждого ИмяПоля Из ТоварныеПоляМассив Цикл
	//			ОблТовар.Параметры.ТоварныеПоля = Строка(Строка[ИмяПоля]) + ", ";
	//		КонецЦикла;
	//		ОблТовар.Параметры.ТоварныеПоля = Лев(ОблТовар.Параметры.ТоварныеПоля, СтрДлина(ОблТовар.Параметры.ТоварныеПоля) - 2);
	//		
	//		ТабличныйДокумент.Вывести(ОблТовар);
	//	КонецЦикла;
	//Иначе
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Таблица с товарами пуста. Выберите склад и нажмите кнопку Заполнить таблицу";
	//	Сообщение.Сообщить();
	//	Возврат Неопределено;
	//КонецЕсли;
	//
	//ТабличныйДокумент.Вывести(ОблПодвал);
	//
	//
	//ТаблицаИсполнителей = Объект.Товары.Выгрузить(,"Исполнитель");
	//ТаблицаИсполнителей.Свернуть("Исполнитель");
	//Для Каждого Строка Из ТаблицаИсполнителей Цикл
	//	ОблИсполнитель.Параметры.Исполнитель = Строка(Строка.Исполнитель);
	//	ТабличныйДокумент.Вывести(ОблИсполнитель);		
	//КонецЦикла;
	//
	//ТабличныйДокумент.ТолькоПросмотр = Истина;
	//ТабличныйДокумент.ОтображатьЗаголовки = Истина;
	//ТабличныйДокумент.ОтображатьСетку = Ложь; 
	//ТабличныйДокумент.АвтоМасштаб = Истина;
	//ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	//
	//Если ПривилегированныйРежим() Тогда
	//	УстановитьПривилегированныйРежим(Ложь);
	//КонецЕсли;
	//
	//Возврат ТабличныйДокумент;
	
	
КонецФункции

Функция КоличествоЛицензийТСД()
	
	НаборЗаписей = РегистрыСведений.вмс_Лицензии.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Возврат НаборЗаписей.Количество();
	
КонецФункции

Функция ЛицензииПодсистем()
	
	НаборЗаписей = РегистрыСведений.вмс_ЛицензииПодсистем.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Возврат НаборЗаписей;
	
КонецФункции

Функция КоличествоУслугОХ()
	
	Текст = "
	|ВЫБРАТЬ
	|	вмс_УслугиОтветственногоХранения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_УслугиОтветственногоХранения КАК вмс_УслугиОтветственногоХранения
	|ГДЕ
	|	НЕ вмс_УслугиОтветственногоХранения.ПометкаУдаления
	|	И НЕ вмс_УслугиОтветственногоХранения.ЭтоГруппа
	|";
	
	Запрос = Новый Запрос(Текст);
	
	Возврат Запрос.Выполнить().Выбрать().Количество();
	
КонецФункции

Функция КоличествоВидовСерийногоТовара()
	
	НаборЗаписей = РегистрыСведений.вмс_СоединениеОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Схема.Установить(вмс_ОперацииПоЯчейкамВызовСервера.СхемаСоединения_ИспользованиеСерий());
	НаборЗаписей.Прочитать();
	
	Возврат НаборЗаписей.Количество();
	
КонецФункции

Функция ТаблицаЗаполненияТопологии()
	
	Текст = "
	|ВЫБРАТЬ
	|	вмс_МестаХранения.Владелец КАК НазваниеСклада,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вмс_МестаХранения.Ссылка) КАК КоличествоЯчеек,
	|	СУММА(ВЫБОР
	|			КОГДА вмс_МестаХранения.ТипЯчейки = ЗНАЧЕНИЕ(Перечисление.вмс_ТипыЯчеек.ЗонаПриемки)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоЗонПриемки,
	|	СУММА(ВЫБОР
	|			КОГДА вмс_МестаХранения.ТипЯчейки = ЗНАЧЕНИЕ(Перечисление.вмс_ТипыЯчеек.ЗонаОтгрузки)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоЗонОтгрузки
	|ИЗ
	|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
	|
	|СГРУППИРОВАТЬ ПО
	|	вмс_МестаХранения.Владелец
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоЯчеек УБЫВ
	|";
	
	Запрос = Новый Запрос(Текст);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ТаблицаЗаполненияОпераций()
	Текст = "
	|ВЫБРАТЬ
	|	вмс_Операции.Ссылка КАК Операция,
	|	вмс_ПравилаЗаполненияЗадачиКладовщику.Ссылка КАК Правило,
	|	вмс_ПравилаЗаполненияЗадачиКладовщику.РаспоряжениеКонфигуратор КАК Распоряжение,
	|	вмс_ПравилаЗаполненияЗадачиКладовщику.ПодбиратьЯчейкиОтправители КАК ИспользоватьОтбор,
	|	вмс_ПравилаЗаполненияЗадачиКладовщику.ПодбиратьЯчейкиПолучатели КАК ИспользоватьРазмещение
	|ИЗ
	|	Справочник.вмс_Операции КАК вмс_Операции
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.вмс_ПравилаЗаполненияЗадачиКладовщику КАК вмс_ПравилаЗаполненияЗадачиКладовщику
	|		ПО вмс_Операции.Ссылка = вмс_ПравилаЗаполненияЗадачиКладовщику.ОперацияНазначение
	|			И (НЕ вмс_ПравилаЗаполненияЗадачиКладовщику.ПометкаУдаления)
	|ГДЕ
	|	НЕ вмс_Операции.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Правило
	|";
	
	Запрос = Новый Запрос(Текст);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
